BAS BMEKZU Project/src/Documents/скEDI_ЗапросНаПолучениеВедомостейЕРАН/скEDI_ЗапросНаПолучениеВедомостейЕРАН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>скEDI_ЗапросНаПолучениеВедомостейЕРАН</name>
  <posting>Deny</posting>
  <attributes>
    <name>ОрганизацияEDI</name>
    <type>
      <types>CatalogRef.скEDI_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыПоФормеП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыПоФормеС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Документы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыНаДату</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыВыданые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыПолученые</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыПервыйЭкземпляр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументыВторойЭкземпляр</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияПоГлавномуПредприятию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияТолькоПоФилиалу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФилиалПродавца</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияПоГлавномуПредприятиюПокупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияТолькоПоФилиалуПокупатель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФилиалПокупатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоСписку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортДокументаСКвитанцией</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КтоОформилЗапрос</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклоненияДФС</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяОперация</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>ИННПродавца</name>
      <comment>Идентификационный номер налогоплательщика</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИННПокупателя</name>
      <comment>Идентификационный номер налогоплательщика</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подписи</name>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>CatalogRef.скEDI_Подписи</types>
        <types>CatalogRef.скEDI_ГруппыПодписей</types>
      </type>
    </attributes>
    <attributes>
      <name>Подписано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодписиКонтрагента</name>
    <attributes>
      <name>ТелоСертификата</name>
      <comment>Base64-строка, построенная на основании двоичных данных файла сертификата</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПодписанта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>511</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьПодписанта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подписано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.скEDI_РолиПодписей</types>
      </type>
    </attributes>
    <attributes>
      <name>ДРФОПодписанта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТелоФаксимиле</name>
      <comment>Не используется</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>TSPСтатус</name>
      <type>
        <types>EnumRef.скEDI_TSPСтатус</types>
      </type>
    </attributes>
    <attributes>
      <name>OCSPСтатус</name>
      <type>
        <types>EnumRef.скEDI_OCSPСтатус</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыпискаСписокПолученыеДокументы</name>
    <attributes>
      <name>ИННПродавца</name>
      <comment>Идентификационный номер налогоплательщика</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрацииДокумента1</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерДокумента1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрацииДокумента2</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерДокумента2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыпискаСписокВыданыеДокументы</name>
    <attributes>
      <name>ИННПродавца</name>
      <comment>Идентификационный номер налогоплательщика</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДокумента</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрацииДокумента1</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерДокумента1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрацииДокумента2</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегистрационныйНомерДокумента2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/InformationRegisters/скEDI_УстановкаДатыРегистрацииВЕРНН_Выписка/скEDI_УстановкаДатыРегистрацииВЕРНН_Выписка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>скEDI_УстановкаДатыРегистрацииВЕРНН_Выписка</name>
  <resources>
    <name>ДатаРегистрацииДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РегистрационныйНомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.скEDI_Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлектронныйДокументВыписка</name>
    <type>
      <types>DocumentRef.скEDI_ЗапросНаПолучениеВедомостейЕРНН</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВхИсх</name>
    <type>
      <types>EnumRef.скEDI_ВхИсхЭлектронныйДокумент</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.скEDI_ТипыЭлектронныхДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СпецРежимНалогообложения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Филиал</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИННПродавца</name>
    <comment>Идентификационный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС/скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоКвитанциюОтДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоПодтверждениеОтДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОтклонениеОтДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОтветОтДФС</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС/скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС</name>
  <enumValues>
    <name>Запрос</name>
  </enumValues>
  <enumValues>
    <name>Ответ</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/скEDI_ВхИсхЭлектронныйДокумент/скEDI_ВхИсхЭлектронныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_ВхИсхЭлектронныйДокумент</name>
  <enumValues>
    <name>Входящий</name>
  </enumValues>
  <enumValues>
    <name>Исходящий</name>
  </enumValues>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/скEDI_ТипыЭлектронныхДокументов/скEDI_ТипыЭлектронныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_ТипыЭлектронныхДокументов</name>
  <enumValues>
    <name>ПервичныйДокумент</name>
  </enumValues>
  <enumValues>
    <name>НалоговаяНакладная</name>
  </enumValues>
  <enumValues>
    <name>Приложение2КНалоговойНакладной</name>
  </enumValues>
  <enumValues>
    <name>ДокументСВложениями</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Documents/скEDI_ЗапросНаПолучениеВедомостейЕРАН/ObjectModule.bsl
Процедура ПередУдалением(Отказ)
	//Отказ = Не МонопольныйРежим();
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Состояние = Перечисления.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.Создан;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Состояние = Перечисления.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.Создан;
	ИмяФайлаДФС = "";
	КтоОформилЗапрос = Неопределено;
	Подписи.Очистить();
	ВыпискаСписокВыданыеДокументы.Очистить();
	ВыпискаСписокПолученыеДокументы.Очистить();
	ДатаОтправки = Неопределено;
	ДатаПолученияОтвета = Неопределено;
	ПричинаОтклоненияДФС = "";
КонецПроцедуры

Функция УдалитьЛидирующиеНулиИНН(Знач ИНН)
	ИНН = СокрЛП(ИНН);
	Пока Лев(ИНН, 1) = "0" Цикл
		ИНН = Сред(ИНН, 2);
	КонецЦикла;
	Возврат ИНН;
КонецФункции

Функция ЗагрузитьВытяг(ОрганизацияПолучатель, ДанныеДокумента, УзелDECLARHEAD, УзелDECLARBODY, ДатаСобытия) Экспорт
	тДатаВитягу = "";
	тВремяВитягу = "";
	Для Каждого ДочернийУзелDECLARBODY Из УзелDECLARBODY.ДочерниеУзлы Цикл
		ФлагЗначениеПолучено = Ложь;
		НомерСтрокиТабличнойЧасти = "";
		ИмяТабличнойЧасти = "";
		ИмяРеквизитаТабличнойЧасти = "";
		ЗначениеРеквизита = Неопределено;
		
		Если ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("HDATE") Тогда
			тДатаВитягу = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("HTIME") Тогда
			тВремяВитягу = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
		/////////////////////////////////
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T1RXXXXG2S") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокПолученыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "ИННПродавца";
			ЗначениеРеквизита = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			ФлагЗначениеПолучено = Истина;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T1RXXXXG3") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокПолученыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "НомерДокумента";
			ЗначениеРеквизита = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			ФлагЗначениеПолучено = Истина;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T1RXXXXG4D") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокПолученыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "ДатаДокумента";
			тДата = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			дГод = 0;
			дМесяц = 0;
			дДень = 0;
			Если скEDI_ОбщегоНазначения.ПолучитьГодМесяцДеньИзДатыФорматаДДММГГГГ(тДата, дГод, дМесяц, дДень) Тогда
				ЗначениеРеквизита = Дата(дГод, дМесяц, дДень);
				ФлагЗначениеПолучено = Истина;
			КонецЕсли;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T1RXXXXG5S") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокПолученыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "ВидДокумента";
			ЗначениеРеквизита = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			ФлагЗначениеПолучено = Истина;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T1RXXXXG6") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокПолученыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "РегистрационныйНомерДокумента1";
			ЗначениеРеквизита = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			ФлагЗначениеПолучено = Истина;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T1RXXXXG7D") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокПолученыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "ДатаРегистрацииДокумента1";
			тДата = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			дГод = 0;
			дМесяц = 0;
			дДень = 0;
			Если скEDI_ОбщегоНазначения.ПолучитьГодМесяцДеньИзДатыФорматаДДММГГГГ(тДата, дГод, дМесяц, дДень) Тогда
				ЗначениеРеквизита = Дата(дГод, дМесяц, дДень);
				ФлагЗначениеПолучено = Истина;
			КонецЕсли;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T1RXXXXG8") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокПолученыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "РегистрационныйНомерДокумента2";
			ЗначениеРеквизита = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			ФлагЗначениеПолучено = Истина;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T1RXXXXG9D") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокПолученыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "ДатаРегистрацииДокумента2";
			тДата = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			дГод = 0;
			дМесяц = 0;
			дДень = 0;
			Если скEDI_ОбщегоНазначения.ПолучитьГодМесяцДеньИзДатыФорматаДДММГГГГ(тДата, дГод, дМесяц, дДень) Тогда
				ЗначениеРеквизита = Дата(дГод, дМесяц, дДень);
				ФлагЗначениеПолучено = Истина;
			КонецЕсли;
		/////////////////////////////////
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T2RXXXXG2S") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокВыданыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "ИННПродавца";
			ЗначениеРеквизита = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			ФлагЗначениеПолучено = Истина;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T2RXXXXG3") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокВыданыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "НомерДокумента";
			ЗначениеРеквизита = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			ФлагЗначениеПолучено = Истина;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T2RXXXXG4D") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокВыданыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "ДатаДокумента";
			тДата = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			дГод = 0;
			дМесяц = 0;
			дДень = 0;
			Если скEDI_ОбщегоНазначения.ПолучитьГодМесяцДеньИзДатыФорматаДДММГГГГ(тДата, дГод, дМесяц, дДень) Тогда
				ЗначениеРеквизита = Дата(дГод, дМесяц, дДень);
				ФлагЗначениеПолучено = Истина;
			КонецЕсли;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T2RXXXXG5S") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокВыданыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "ВидДокумента";
			ЗначениеРеквизита = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			ФлагЗначениеПолучено = Истина;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T2RXXXXG6") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокВыданыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "РегистрационныйНомерДокумента1";
			ЗначениеРеквизита = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			ФлагЗначениеПолучено = Истина;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T2RXXXXG7D") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокВыданыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "ДатаРегистрацииДокумента1";
			тДата = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			дГод = 0;
			дМесяц = 0;
			дДень = 0;
			Если скEDI_ОбщегоНазначения.ПолучитьГодМесяцДеньИзДатыФорматаДДММГГГГ(тДата, дГод, дМесяц, дДень) Тогда
				ЗначениеРеквизита = Дата(дГод, дМесяц, дДень);
				ФлагЗначениеПолучено = Истина;
			КонецЕсли;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T2RXXXXG8") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокВыданыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "РегистрационныйНомерДокумента2";
			ЗначениеРеквизита = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			ФлагЗначениеПолучено = Истина;
		ИначеЕсли ВРег(ДочернийУзелDECLARBODY.ИмяУзла) = ВРег("T2RXXXXG9D") Тогда
			ИмяТабличнойЧасти = "ВыпискаСписокВыданыеДокументы";
			ИмяРеквизитаТабличнойЧасти = "ДатаРегистрацииДокумента2";
			тДата = ДочернийУзелDECLARBODY.ТекстовоеСодержимое;
			дГод = 0;
			дМесяц = 0;
			дДень = 0;
			Если скEDI_ОбщегоНазначения.ПолучитьГодМесяцДеньИзДатыФорматаДДММГГГГ(тДата, дГод, дМесяц, дДень) Тогда
				ЗначениеРеквизита = Дата(дГод, дМесяц, дДень);
				ФлагЗначениеПолучено = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ФлагЗначениеПолучено Тогда
			Для Каждого АтрибутУзла Из ДочернийУзелDECLARBODY.Атрибуты Цикл
				Если ВРег(АтрибутУзла.Имя) = ВРег("ROWNUM") Тогда
					НомерСтрокиТабличнойЧасти = Число(АтрибутУзла.Значение);
				КонецЕсли;
			КонецЦикла;
			
			ТабличнаяЧастьДокумента = ЭтотОбъект[ИмяТабличнойЧасти];
			Пока ТабличнаяЧастьДокумента.Количество() < НомерСтрокиТабличнойЧасти Цикл
				ТабличнаяЧастьДокумента.Добавить();
			КонецЦикла;
			СтрокаТабличнойЧасти = ТабличнаяЧастьДокумента.Получить(НомерСтрокиТабличнойЧасти-1);
			СтрокаТабличнойЧасти[ИмяРеквизитаТабличнойЧасти] = ЗначениеРеквизита;
		КонецЕсли;
	КонецЦикла;
	
	дГод = 0;
	дМесяц = 0;
	дДень = 0;
	Если скEDI_ОбщегоНазначения.ПолучитьГодМесяцДеньИзДатыФорматаДДММГГГГ(тДатаВитягу, дГод, дМесяц, дДень) Тогда
		дЧас = 0;
		дМинута = 0;
		дСекунда = 0;
		Если скEDI_ОбщегоНазначения.ПолучитьВремяФорматаЧЧММСС(тВремяВитягу, дЧас, дМинута, дСекунда) Тогда
			ДатаВремяВитягу = Дата(дГод, дМесяц, дДень, дЧас, дМинута, дСекунда);
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	ДатаФормированияОтвета = ДатаВремяВитягу;
	ДатаПолученияОтвета = ДатаСобытия;
	Состояние = Перечисления.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоОтветОтДФС;
	
	лМассивПодписей = скEDI_ОбщегоНазначения.ПолучитьМассивПодписейИзМассиваСоответствий(ДанныеДокумента.Получить("Signers"));
	//ИнформацияОПолученомДокументе = ИнформацияОПолученомДокументе + "
	//		|
	//		|Підписи:";
	//ДополнитьОписаниеДаннымиПоПодписямКонтрагента(лМассивПодписей, ИнформацияОПолученомДокументе, Неопределено, Ложь, Ложь);
	лМассивДанныхПоПодписямКонтрагента = скEDI_ОбщегоНазначения.СформироватьМассивДанныхПоПодписямКонтрагента(лМассивПодписей);
	Для Каждого лИнформацияОПодписи Из лМассивДанныхПоПодписямКонтрагента Цикл
		лНоваяСтрокаПодписиКонтрагента = ПодписиКонтрагента.Добавить();
		ЗаполнитьЗначенияСвойств(лНоваяСтрокаПодписиКонтрагента, лИнформацияОПодписи);
	КонецЦикла;
	
	Записать();
	
	скEDI_ВнешниеХранилища.СохранитьСодержимоеДополнительногоЭлектронногоДокументаДФС(Ссылка, Перечисления.скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС.Ответ, ДанныеДокумента.Получить("Body"), "", ДатаСобытия);
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи = РегистрыСведений.скEDI_СодержимоеДополнительныхЭлектронныхДокументовДФС.СоздатьМенеджерЗаписи();
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ЭлектронныйДокумент = Ссылка;
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТипСодержимого = Перечисления.скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС.Ответ;
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ТелоДокумента = ДанныеДокумента.Получить("Body");
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи.ИзображениеДокумента = "";
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи.Дата = ДатаСобытия;
	//СодержимоеЭлектронныхДокументовМенеджерЗаписи.Записать(Истина);
	
	Если Состояние = Перечисления.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоОтветОтДФС Тогда
		Если ИмпортДокументаСКвитанцией Тогда
			Для Каждого СтрокаВыписки Из ВыпискаСписокПолученыеДокументы Цикл
				ДатыРегистрацииВЕРННМенеджерЗаписи = РегистрыСведений.скEDI_УстановкаДатыРегистрацииВЕРНН_Выписка.СоздатьМенеджерЗаписи();
				ДатыРегистрацииВЕРННМенеджерЗаписи.Организация = ОрганизацияПолучатель;
				ДатыРегистрацииВЕРННМенеджерЗаписи.ЭлектронныйДокументВыписка = Ссылка;
				ДатыРегистрацииВЕРННМенеджерЗаписи.ВхИсх = Перечисления.скEDI_ВхИсхЭлектронныйДокумент.Входящий;
				Если ВРег(СтрокаВыписки.ВидДокумента) = "ПН" Тогда
					ДатыРегистрацииВЕРННМенеджерЗаписи.ТипДокумента = Перечисления.скEDI_ТипыЭлектронныхДокументов.НалоговаяНакладная;
				ИначеЕсли ВРег(СтрокаВыписки.ВидДокумента) = "РК" Тогда
					ДатыРегистрацииВЕРННМенеджерЗаписи.ТипДокумента = Перечисления.скEDI_ТипыЭлектронныхДокументов.Приложение2КНалоговойНакладной;
				Иначе
					Продолжить;
				КонецЕсли;
				ДатыРегистрацииВЕРННМенеджерЗаписи.НомерДокумента = СтрокаВыписки.НомерДокумента;
				ДатыРегистрацииВЕРННМенеджерЗаписи.СпецРежимНалогообложения = СтрокаВыписки.СпецРежимНалогообложения;
				ДатыРегистрацииВЕРННМенеджерЗаписи.Филиал = СтрокаВыписки.Филиал;
				ДатыРегистрацииВЕРННМенеджерЗаписи.ДатаДокумента = СтрокаВыписки.ДатаДокумента;
				ДатыРегистрацииВЕРННМенеджерЗаписи.ИННПродавца = УдалитьЛидирующиеНулиИНН(СтрокаВыписки.ИННПродавца);
				ДатыРегистрацииВЕРННМенеджерЗаписи.ДатаРегистрацииДокумента = СтрокаВыписки.ДатаРегистрацииДокумента1;
				ДатыРегистрацииВЕРННМенеджерЗаписи.РегистрационныйНомерДокумента = СтрокаВыписки.РегистрационныйНомерДокумента1;
				ДатыРегистрацииВЕРННМенеджерЗаписи.ДатаПолучения = ДатаСобытия;
				ДатыРегистрацииВЕРННМенеджерЗаписи.Записать(Истина);
			КонецЦикла;
			Для Каждого СтрокаВыписки Из ВыпискаСписокВыданыеДокументы Цикл
				ДатыРегистрацииВЕРННМенеджерЗаписи = РегистрыСведений.скEDI_УстановкаДатыРегистрацииВЕРНН_Выписка.СоздатьМенеджерЗаписи();
				ДатыРегистрацииВЕРННМенеджерЗаписи.Организация = ОрганизацияПолучатель;
				ДатыРегистрацииВЕРННМенеджерЗаписи.ЭлектронныйДокументВыписка = Ссылка;
				ДатыРегистрацииВЕРННМенеджерЗаписи.ВхИсх = Перечисления.скEDI_ВхИсхЭлектронныйДокумент.Исходящий;
				Если ВРег(СтрокаВыписки.ВидДокумента) = "ПН" Тогда
					ДатыРегистрацииВЕРННМенеджерЗаписи.ТипДокумента = Перечисления.скEDI_ТипыЭлектронныхДокументов.НалоговаяНакладная;
				ИначеЕсли ВРег(СтрокаВыписки.ВидДокумента) = "РК" Тогда
					ДатыРегистрацииВЕРННМенеджерЗаписи.ТипДокумента = Перечисления.скEDI_ТипыЭлектронныхДокументов.Приложение2КНалоговойНакладной;
				Иначе
					Продолжить;
				КонецЕсли;
				ДатыРегистрацииВЕРННМенеджерЗаписи.НомерДокумента = СтрокаВыписки.НомерДокумента;
				ДатыРегистрацииВЕРННМенеджерЗаписи.СпецРежимНалогообложения = СтрокаВыписки.СпецРежимНалогообложения;
				ДатыРегистрацииВЕРННМенеджерЗаписи.Филиал = СтрокаВыписки.Филиал;
				ДатыРегистрацииВЕРННМенеджерЗаписи.ДатаДокумента = СтрокаВыписки.ДатаДокумента;
				ДатыРегистрацииВЕРННМенеджерЗаписи.ИННПродавца = УдалитьЛидирующиеНулиИНН(СтрокаВыписки.ИННПродавца);
				ДатыРегистрацииВЕРННМенеджерЗаписи.ДатаРегистрацииДокумента = СтрокаВыписки.ДатаРегистрацииДокумента;
				ДатыРегистрацииВЕРННМенеджерЗаписи.РегистрационныйНомерДокумента = СтрокаВыписки.РегистрационныйНомерДокумента;
				ДатыРегистрацииВЕРННМенеджерЗаписи.ДатаПолучения = ДатаСобытия;
				ДатыРегистрацииВЕРННМенеджерЗаписи.Записать(Истина);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат Истина;
КонецФункции
